In [3]:
import pandas as pd

In [4]:
temp = pd.read_excel('file_example_XLSX_50_sheets.xlsx',
                    sheet_name=1)

In [5]:
temp.head()

,0,First Name S2,Last Name S2,Gender S2,Country S2,Age S2,Date S2,Id S2
0,1,Dulce,Abril,Female,United States,32,15/10/2017,1562
1,2,Mara,Hashimoto,Female,Great Britain,25,16/08/2016,1582
2,3,Philip,Gent,Male,France,36,21/05/2015,2587
3,4,Kathleen,Hanner,Female,United States,25,15/10/2017,3549
4,5,Nereida,Magwood,Female,United States,58,16/08/2016,2468

In [7]:
# temp.to_excel('')